<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(
    /*------链接文字------*/
    'href' => array(
        'all'             => '全部',
        'add'             => '创建',
        'help'            => '帮助',
        'upload'          => '上传',
        'select'          => '选择',
        'recycle'         => '回收站',
    ),

    /*------说明文字------*/
    'label' => array(
        'id'              => 'ID',
        'add'             => '创建',
        'all'             => '全部',
        'key'             => '关键词',
        'status'          => '状态',
        'admin'           => '管理员',
        'normal'          => '正常', //草稿
        'recycle'         => '回收站', //回收站
        'unknown'         => '未知', //未知
        'waiting'         => '等待上传...',

        'attachInfo'      => '图片信息',

        'uploading'       => '正在上传 ...',
        'uploadSucc'      => '上传成功',
        'uploadOver'      => '上传完毕',
        'needH5'          => '上传插件需要 HTML5，请升级您的浏览器！',
        'returnErr'       => '返回错误，非 JSON',
    ),

    /*------选择项------*/
    'option' => array(
        'allExt'          => '所有类型', //所有类型
        'allYear'         => '所有年份', //所有年份
        'allMonth'        => '所有月份', //所有月份

        'please'          => '请选择',
        'batch'           => '批量操作',
        'del'             => '永久删除',
        'revert'          => '放回原处',
        'recycle'         => '放入回收站',
    ),

    /*------按钮------*/
    'btn' => array(
        'browse'      => '请选择图片...',
        'submit'      => '提交',
        'save'        => '保存',
        'upload'      => '开始上传',
        'attachClear' => '图片清理',
        'empty'       => '清空回收站', //清空回收站
    ),

    /*------确认框------*/
    'confirm' => array(
        'del'     => '确认永久删除吗？此操作不可恢复！',
        'clear'   => '确认清理图片吗？此操作将耗费较长时间！', //确认清空回收站
        'empty'   => '确认清空回收站吗？此操作不可恢复！', //确认清空回收站
    ),
);
