<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(

    /*------页面标题------*/
    'page' => array(
        'forgot' => '找回密码',
    ),

    /*------链接文字------*/
    'href' => array(
        'forgot'    => '忘记密码',
        'login'     => '直接登录',
    ),

    'label' => array(
        'username'      => '用户名', //用户名
        'answer'        => '回答',
        'passNew'       => '新密码', //密码
        'passConfirm'   => '确认密码', //密码
        'seccode'       => '验证码',
    ),

    /*------长篇文字------*/
    'text' => array(
        'forgotByMail'  => '选择此方式找回密码，系统将向您预留的邮箱发送确认邮件。',
    ),

    'btn' => array(
        'submit'  => '提交',
        'prev'    => '上一步',
        'next'    => '下一步',
        'seccode'   => '看不清', //验证码
    ),
);
