<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(

    /*------页面标题------*/
    'page' => array(
        'add'       => '创建', //创建
        'edit'      => '编辑', //编辑
        'order'     => '排序', //排序
    ),

    /*------链接文字------*/
    'href' => array(
        'add'   => '创建', //创建
        'edit'  => '编辑', //编辑
        'order' => '排序',
        'help'  => '帮助',
    ),

    /*------说明文字------*/
    'label' => array(
        'id'            => 'ID', //ID
        'all'           => '全部',
        'key'           => '关键词', //关键词
        'status'        => '状态', //状态
        'linkName'      => '链接名称',
        'linkUrl'       => '链接地址',
        'isBlank'       => '新窗口中打开',

        'order' => '排序',
        'orderFirst'    => '移到最前',
        'orderLast'     => '移到最后',
        'orderAfter'    => '该 ID 之后',
    ),

    'status' => array(
        'enable'  => '启用', //生效
        'disable' => '禁用', //禁用
    ),

    'option' => array(
        'allStatus'     => '所有状态', //所有
        'pleaseSelect'  => '请选择', //请选择
        'batch'         => '批量操作', //批量操作
        'cache'         => '更新缓存',
        'del'           => '永久删除', //删除
    ),

    /*------按钮------*/
    'btn' => array(
        'save'        => '保存', //提交
        'submit'      => '提交', //提交
    ),

    /*------确认框------*/
    'confirm' => array(
        'del'         => '确认永久删除吗？此操作不可恢复！', //确认清空回收站
    ),
);
