<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(

    'page' => array(
        'add'             => '安装',
        'edit'            => '编辑',
        'show'            => '查看',
        'opt'             => '插件设置',
    ),

    /*------链接文字------*/
    'href' => array(
        'add'             => '安装',
        'edit'            => '编辑',
        'opt'             => '插件设置',
        'help'            => '帮助',
        'show'            => '查看',
    ),

    /*------说明文字------*/
    'label' => array(
        'id'              => 'ID', //ID
        'all'             => '全部',
        'key'             => '关键词', //关键词
        'status'          => '状态', //状态
        'note'            => '备注', //备注

        'pluginId'        => '插件 ID',
        'pluginName'      => '插件名称',
        'pluginClass'     => 'PHP 类名',
        'pluginVer'       => '插件版本',
        'pluginAuthor'    => '插件作者',
        'pluginDir'       => '插件目录',
        'detail'          => '说明',
        'installed'       => '已安装的插件',
        'source'          => '插件源信息',
    ),

    'status' => array(
        'not'       => '未安装', //未安装
        'error'     => '插件错误', //插件错误
        'enable'    => '启用', //生效
        'disable'   => '禁用', //禁用
    ),

    'option' => array(
        'allStatus'         => '所有状态', //所有
        'batch'             => '批量操作', //批量操作
        'del'               => '卸载', //删除
    ),

    /*------按钮------*/
    'btn' => array(
        'submit'      => '提交',
        'del'         => '卸载',
        'save'        => '保存', //提交
    ),

    /*------确认框------*/
    'confirm' => array(
        'del'         => '确认卸载吗？此操作不可恢复！', //确认清空回收站
    ),
);
