<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(

    /*------页面标题------*/
    'page' => array(
        'pm'                => '消息',
        'send'              => '新消息',
        'reply'             => '回复',
        'show'            => '查看',
    ),

    /*------链接文字------*/
    'href' => array(
        'pm'              => '消息',
        'send'            => '新消息',
        'reply'           => '回复',
    ),

    /*------说明文字------*/
    'label' => array(
        'id'              => 'ID', //ID
        'all'             => '全部',
        'key'             => '关键词', //关键词
        'unknown'         => '未知', //未知

        'status'          => '状态',
        'pm'              => '消息',
        'pmFrom'          => '发件人',
        'pmTo'            => '收件人',
        'pmToNote'        => '收件人用户名，多个收件人请用 <kbd>|</kbd> 分隔',
        'pmSys'           => '系统消息',
        'time'            => '时间',
        'reply'           => '回复',
        'revoke'          => '撤回',

        'title'           => '标题',
        'content'         => '内容',
    ),

    'option' => array(
        'allStatus'         => '所有状态', //所有
        'batch'             => '批量操作', //批量操作
        'del'               => '永久删除', //删除
    ),


    /*------按钮------*/
    'btn' => array(
        'submit'      => '提交', //提交
        'revoke'      => '撤回',
        'send'        => '发送',
    ),

    /*------确认框------*/
    'confirm' => array(
        'del'         => '确认永久删除吗？此操作不可恢复！', //确认清空回收站
    ),
);
