<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_GINKGO')) {
    return 'Access denied';
}

/*-------------------------通用-------------------------*/
return array(
    'Access denied'                         => '拒绝访问',
    'Input error'                           => '输入错误，请检查！',
    'Help'                                  => '帮助',
    'Token'                                 => '表单令牌',
    'Close'                                 => '关闭',
    'Form token error'                      => '表单令牌错误',
    'Missing ID'                            => '无法获取 ID',
    'Ad invalidation'                       => '广告已无效',
    'Invalid URL'                           => '无效的 URL',
);
